In [4]:
import pandas as pd

In [9]:
sales = pd.DataFrame({'fruits':['사과','딸기','수박'],
                      'price':[1800,1500,3000],
                      'volume':[24,38,13]})
sales

  fruits  price  volume
0     사과   1800      24
1     딸기   1500      38
2     수박   3000      13

In [20]:
# 가격의 평균 출력하기
# 판매량의 평균 출력하기
print('가격의 평균 : ', sales['price'].sum()/len(sales['price']),'원')
print('판매량의 평균 : ', sales['volume'].sum()/len(sales['volume']),'원')

가격의 평균 :  2100.0 원
판매량의 평균 :  25.0 원

In [16]:
x = [1,2,3,4,5]
x

[1, 2, 3, 4, 5]

In [17]:
len(x)

5

In [18]:
len(sales)

3

In [22]:
df_exam_novar = pd.read_excel('excel_exam_novar.xlsx', header = None) # 머리글이 없을 떄 옵션 header = none
df_exam_novar

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15
5  6  3  50  98  45
6  7  4  46  98  65
7  8  4  48  87  12